microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/sip-mc-development-board-an1299-dspic33edv64mc205/pmsm.c
        /* Flux weakening control - the actual speed is replaced 
        with the reference speed for stability 
        reference for d current component 
        adapt the estimator parameters in concordance with the speed */
        ctrlParm.qVdRef=FieldWeakening(_Q15abs(ctrlParm.qVelRef));

        /* PI control for D */
        piInputId.inMeasure = idq.d;
        piInputId.inReference  = ctrlParm.qVdRef;
        MC_ControllerPIUpdate_Assembly(piInputId.inReference,
                                       piInputId.inMeasure,
                                       &piInputId.piState,
                                       &piOutputId.out);
        vdq.d    = piOutputId.out;

        /* Dynamic d-q adjustment
         with d component priority 
         vq=sqrt (vs^2 - vd^2) 
        limit vq maximum to the one resulting from the calculation above */
        temp_qref_pow_q15 = (int16_t)(__builtin_mulss(piOutputId.out ,
                                                      piOutputId.out) >> 15);
        temp_qref_pow_q15 = Q15(MAX_VOLTAGE_VECTOR) - temp_qref_pow_q15;
        piInputIq.piState.outMax = Q15SQRT (temp_qref_pow_q15);

        /* PI control for Q */
        piInputIq.inMeasure  = idq.q;
        piInputIq.inReference  = ctrlParm.qVqRef;
        MC_ControllerPIUpdate_Assembly(piInputIq.inReference,
                                       piInputIq.inMeasure,
                                       &piInputIq.piState,
                                       &piOutputIq.out);
        vdq.q = piOutputIq.out;
    }
       
}
// *****************************************************************************
/* Function:
    ADCInterrupt()
  Summary:
    ADCInterrupt() ISR routine

  Description:
    Does speed calculation and executes the vector update loop
    The ADC sample and conversion is triggered by the PWM period.
    The speed calculation assumes a fixed time interval between calculations.

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void __attribute__((interrupt, no_auto_psv)) _ADCInterrupt(void)
{
    #ifdef SINGLE_SHUNT
    /* If SINGLE_SHUNT is Enabled then single shunt three phase reconstruction
       algorithm is executed in this ISR */   
    if (uGF.bits.RunMotor)
    {
        /* If single shunt algorithm is enabled, three ADC interrupts will be
		 serviced every PWM period in order to sample current twice and
		 be able to reconstruct the three phases and to read the value of POT*/
        
        switch(singleShuntParam.adcSamplePoint)
        {
            /* This algorithm only reads one analog input when running in 
                single shunt mode. During PWM Timer is counting down, sample
                and hold zero is configured to read bus current. Once the 
                algorithm is done measuring shunt current at two different 
                times, then the input of this sample and hold is configured 
                to read the POT when PWM Timer is counting up*/
            case SS_SAMPLE_POT:
                /*Set Trigger to measure BusCurrent first sample during PWM 
                  Timer is counting down*/
                INVERTERA_PWM_SEVTCMP = singleShuntParam.trigger1; 
                singleShuntParam.adcSamplePoint = 1; 
                /*Set ADC Channel 0 to measure Bus Current*/
                AD1CHS0bits.CH0SA = ADC1_ANx_CH0_IBUS;
                                            
            break;
            case SS_SAMPLE_BUS1:
               
                /*Set Trigger to measure BusCurrent Second sample during PWM 
                  Timer is counting down*/
                INVERTERA_PWM_SEVTCMP = singleShuntParam.trigger2;
                singleShuntParam.adcSamplePoint = 2;  
                /* Ibus is measured and offset removed from measurement*/
                singleShuntParam.Ibus1 = (signed int)(ADCBUF_INV_A_IBUS) - measCurrParm.offsetBus;
                /*PWM DutyCycle is operating in dual update mode and update
                 duty cycle registers which will effective when PWM Timer 
                 Counter is zero*/
                PWMDutyCycleSet(&singleShuntParam.pwmDutycycle2);
                
            break;
            case SS_SAMPLE_BUS2:
                
                /*Set Trigger to measure POT Value when PWM 
                  Timer value is zero*/
                INVERTERA_PWM_SEVTCMP = LOOPTIME_TCY;
                singleShuntParam.adcSamplePoint = 0;
                /* this interrupt corresponds to the second trigger and 
                    save second current measured*/
                /* Ibus is measured and offset removed from measurement*/
                singleShuntParam.Ibus2 = (signed int)(ADCBUF_INV_A_IBUS) - measCurrParm.offsetBus;
                /*Set ADC Channel 0 to measure POT Value*/
                AD1CHS0bits.CH0SA = ADC1_ANx_CH0_POT;
                /* Reconstruct Phase currents from Bus Current*/                
                SingleShunt_PhaseCurrentReconstruction(&singleShuntParam);
                /* Calculate qIa,qIb */
                MeasCompCurr(singleShuntParam.Ia, singleShuntParam.Ib,&measCurrParm); 
            break;
            
            default:
            break;  
        }
        
    }   
#else  
    /* When single shunt is not enabled, that is when is running dual 
        shunt resistor algorithm, ADC interrupt is serviced only once*/
    if (uGF.bits.RunMotor)
    {
        /* Calculate qIa,qIb */
        MeasCompCurr(ADCBUF_INV_A_IPHASE1, ADCBUF_INV_A_IPHASE2,&measCurrParm);
    }
#endif
    /* Clear Interrupt Flag */
    ClearADCIF();
}
// *****************************************************************************
/* Function:
    CalculateParkAngle ()

  Summary:
    Function calculates the angle for open loop control

  Description:
    Generate the start sine waves feeding the motor terminals
    Open loop control, forcing the motor to align and to start speeding up .
 
  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

