microchip-pic-avr-solutions/sip-mc-development-board-an1299-dspic33edv64mc205/sip-mc-development-board-an1299-dspic33edv64mc205/pmsm.c
  Remarks:
    None.
 */
void CalculateParkAngle(void)
{
    /* if open loop */
    if (uGF.bits.OpenLoop)
    {
        /* begin with the lock sequence, for field alignment */
        if (motorStartUpData.startupLock < LOCK_TIME)
        {
            motorStartUpData.startupLock += 1;
        }
        /* Then ramp up till the end speed */
        else if (motorStartUpData.startupRamp < END_SPEED)
        {
            motorStartUpData.startupRamp += OPENLOOP_RAMPSPEED_INCREASERATE;
        }
        /* Switch to closed loop */
        else 
        {
            #ifndef OPEN_LOOP_FUNCTIONING
                uGF.bits.ChangeMode = 1;
                uGF.bits.OpenLoop = 0;
            #endif
        }
        /* The angle set depends on startup ramp */
        thetaElectricalOpenLoop += (int16_t)(motorStartUpData.startupRamp >> 
                                            STARTUPRAMP_THETA_OPENLOOP_SCALER);

    }
    /* Switched to closed loop */
    else 
    {
        /* In closed loop slowly decrease the offset add to the estimated angle */
        if (estimator.qRhoOffset > 0)
        {
            estimator.qRhoOffset--;
        }
    }
}
// *****************************************************************************
/* Function:
    InitControlParameters()

  Summary:
    Function initializes control parameters

  Description:
    Initialize control parameters: PI coefficients, scaling constants etc.

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void InitControlParameters(void)
{
    /* ADC - Measure Current & Pot */
    /* Scaling constants: Determined by calibration or hardware design.*/
    readADCParm.qK = KPOT;
    measCurrParm.qKa = KCURRA;
    measCurrParm.qKb = KCURRB;
    
    ctrlParm.qRefRamp = SPEEDREFRAMP;
    ctrlParm.speedRampCount = SPEEDREFRAMP_COUNT;
    /* Set PWM period to Loop Time */
    pwmPeriod = LOOPTIME_TCY;
 
    /* PI - Id Current Control */
    piInputId.piState.kp = D_CURRCNTR_PTERM;
    piInputId.piState.ki = D_CURRCNTR_ITERM;
    piInputId.piState.kc = D_CURRCNTR_CTERM;
    piInputId.piState.outMax = D_CURRCNTR_OUTMAX;
    piInputId.piState.outMin = -piInputId.piState.outMax;
    piInputId.piState.integrator = 0;
    piOutputId.out = 0;

    /* PI - Iq Current Control */
    piInputIq.piState.kp = Q_CURRCNTR_PTERM;
    piInputIq.piState.ki = Q_CURRCNTR_ITERM;
    piInputIq.piState.kc = Q_CURRCNTR_CTERM;
    piInputIq.piState.outMax = Q_CURRCNTR_OUTMAX;
    piInputIq.piState.outMin = -piInputIq.piState.outMax;
    piInputIq.piState.integrator = 0;
    piOutputIq.out = 0;

    /* PI - Speed Control */
    piInputOmega.piState.kp = SPEEDCNTR_PTERM;
    piInputOmega.piState.ki = SPEEDCNTR_ITERM;
    piInputOmega.piState.kc = SPEEDCNTR_CTERM;
    piInputOmega.piState.outMax = SPEEDCNTR_OUTMAX;
    piInputOmega.piState.outMin = -piInputOmega.piState.outMax;
    piInputOmega.piState.integrator = 0;
    piOutputOmega.out = 0;
}
void __attribute__ ((interrupt, no_auto_psv)) _CNInterrupt(void)
{
    if (BSP_LATCH_GATE_DRIVER_A_FAULT == false)
    {
        ResetParmeters();
        LED2 = 1;
        HAL_Board_FaultClear();
    }
    else
    {
        LED2 = 0;
        ResetParmeters();
    }
    ClearCNIF(); // Clear CN interrupt
}
void MeasCurrOffset(int16_t *pOffseta,int16_t *pOffsetb,int16_t *pOffsetbus)
{    
    int32_t adcOffsetIa = 0, adcOffsetIb = 0,adcOffsetIbus=0;
    uint16_t i = 0;
                
    /* Enable ADC interrupt and begin main loop timing */
    ClearADCIF();
    EnableADCInterrupt();
    
    /* Taking multiple sample to measure voltage offset in all the channels */
    for (i = 0; i < (1<<CURRENT_OFFSET_SAMPLE_SCALER); i++)
    {
        measCurrOffsetFlag = 0;
        /* Wait for the conversion to complete */
        while (measCurrOffsetFlag == 0);
        /* Sum up the converted results */
        adcOffsetIa += ADCBUF_INV_A_IPHASE1;
        adcOffsetIb += ADCBUF_INV_A_IPHASE2;
        adcOffsetIbus += ADCBUF_INV_A_IBUS;
    }
    /* Averaging to find current Ia offset */
    *pOffseta = (int16_t)(adcOffsetIa >> CURRENT_OFFSET_SAMPLE_SCALER);
    /* Averaging to find current Ib offset*/
    *pOffsetb = (int16_t)(adcOffsetIb >> CURRENT_OFFSET_SAMPLE_SCALER);
    *pOffsetbus = (int16_t)(adcOffsetIbus >> CURRENT_OFFSET_SAMPLE_SCALER);
    measCurrOffsetFlag = 0;
    
    /* Make sure ADC does not generate interrupt while initializing parameters*/
    DisableADCInterrupt();
}

// *****************************************************************************
/* Function:
    PWM1Interrupt()
  Summary:
    PWM1Interrupt() ISR routine

  Description:
    Does speed calculation and executes the vector update loop
    PWM Interrupt  is triggered by the PWM TRIG1.
    The speed calculation assumes a fixed time interval between calculations.

  Precondition:
    None.

  Parameters:
    None

  Returns:
    None.

  Remarks:
    None.
 */
void __attribute__((interrupt, no_auto_psv)) _PWM1Interrupt(void)
{
  if (uGF.bits.RunMotor)
    {        
        iabc.a = measCurrParm.qIa;
        iabc.b = measCurrParm.qIb;
        /* Calculate qId,qIq from qSin,qCos,qIa,qIb */
        MC_TransformClarke_Assembly(&iabc,&ialphabeta);
        MC_TransformPark_Assembly(&ialphabeta,&sincosTheta,&idq);

        /* Speed and field angle estimation */
        Estim();
        /* Calculate control values */
        DoControl();
        /* Calculate qAngle */
        CalculateParkAngle();
        /* if open loop */
        if (uGF.bits.OpenLoop == 1)
        {
            /* the angle is given by park parameter */
            thetaElectrical = thetaElectricalOpenLoop;
        }
        else
        {
            /* if closed loop, angle generated by estimator */
            thetaElectrical = estimator.qRho;
        }
        MC_CalculateSineCosine_Assembly_Ram(thetaElectrical,&sincosTheta);
        MC_TransformParkInverse_Assembly(&vdq,&sincosTheta,&valphabeta);

        MC_TransformClarkeInverseSwappedInput_Assembly(&valphabeta,&vabc);
        
        #ifdef SINGLE_SHUNT
            SingleShunt_CalculateSpaceVectorPhaseShifted(&vabc,pwmPeriod,&singleShuntParam);
            PWMDutyCycleSet(&singleShuntParam.pwmDutycycle1);
        #else
            MC_CalculateSpaceVectorPhaseShifted_Assembly(&vabc,pwmPeriod,
                                                            &pwmDutycycle);
            PWMDutyCycleSet(&pwmDutycycle);
        #endif
    }
    else
    {
        INVERTERA_PWM_PDC1 = pwmDutycycle.dutycycle1;
        INVERTERA_PWM_PDC2 = pwmDutycycle.dutycycle2;
        INVERTERA_PWM_PDC3 = pwmDutycycle.dutycycle3;
        measCurrOffsetFlag = 1; 
    }    
    DiagnosticsStepIsr();
    BoardServiceStepIsr();
   
    /* Clear Interrupt Flag */
    ClearPWM1IF();
}
void PWMDutyCycleSet(MC_DUTYCYCLEOUT_T *pPwmDutycycle)
{
    if (pPwmDutycycle->dutycycle1 < MIN_DUTY)
    {
        pPwmDutycycle->dutycycle1 = MIN_DUTY;
    }
    if (pPwmDutycycle->dutycycle2 < MIN_DUTY)
    {
        pPwmDutycycle->dutycycle2 = MIN_DUTY;
    }
    if (pPwmDutycycle->dutycycle3 < MIN_DUTY)
    {
        pPwmDutycycle->dutycycle3 = MIN_DUTY;
    }
    INVERTERA_PWM_PDC1 = pPwmDutycycle->dutycycle1;
    INVERTERA_PWM_PDC2 = pPwmDutycycle->dutycycle2;
    INVERTERA_PWM_PDC3 = pPwmDutycycle->dutycycle3;
}